# Levelling Activity

The objective of this activity is to train basic machine learning techniques that involves: 

- Pre Processing
- Pattern Extaction
- Model Evaluation

The data for this first practice is tabular and not Unstructured as the name of this subject suggests.

# Part 1: Selecting the Database

The chosen database is called [Binary Classification with a Bank Churn Dataset](https://www.kaggle.com/competitions/playground-series-s4e1/overview) and is a practice dataset developed by Kaggle itself.

# Part 2: Data Exploration

## Libraries

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

## Data Standardization: most common are 
# StandardScaler - mean 0 and var 1 
# MinMaxScaler - between 0 and 1
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler

Setting general style for the notebook

In [2]:
%matplotlib inline
sns.set_style('whitegrid')

## Importing data

In [3]:
data_file_path = '/Users/administrador/Documents/Pessoal/repositorios/unstructured_data_mining/data'

In [14]:
train = pd.read_csv(data_file_path + '/train.csv', index_col=0)

## Data Information:

 - No null values
 - 13 columns
 - 165.034 rows

In [15]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 165034 entries, 0 to 165033
Data columns (total 13 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   CustomerId       165034 non-null  int64
 1   Surname          165034 non-null  object
 2   CreditScore      165034 non-null  int64
 3   Geography        165034 non-null  object
 4   Gender           165034 non-null  object
 5   Age              165034 non-null  float64
 6   Tenure           165034 non-null  int64
 7   Balance          165034 non-null  float64
 8   NumOfProducts    165034 non-null  int64
 9   HasCrCard        165034 non-null  float64
 10  IsActiveMember   165034 non-null  float64
 11  EstimatedSalary  165034 non-null  float64
 12  Exited           165034 non-null  int64
dtypes: float64(5), int64(5), object(3)
memory usage: 17.6+ MB

Data Sample

In [16]:
train.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
id,,,,,,,,,,,,,
0,15674932,Okwudilichukwu,668,France,Male,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,15749177,Okwudiliolisa,627,France,Male,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,15694510,Hsueh,678,France,Male,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,15741417,Kao,581,France,Male,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,15766172,Chiemenam,716,Spain,Male,33.0,5,0.00,2,1.0,1.0,15068.83,0

Deleting CustomerId column

In [25]:
train = train.drop(['CustomerId'], axis=1).copy()

In [26]:
train.head()

,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
id,,,,,,,,,,,,
0,Okwudilichukwu,668,France,Male,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,Okwudiliolisa,627,France,Male,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,Hsueh,678,France,Male,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,Kao,581,France,Male,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,Chiemenam,716,Spain,Male,33.0,5,0.00,2,1.0,1.0,15068.83,0

# Part 2: Pre Processing